src/test/npm/artillery/cpu-test.yaml
config:
  target: "http://13.209.76.141"
  phases:
    - duration: 30
      arrivalRate: 1
      name: Warm up

scenarios:
  - name: "Just get hash"
    flow:
      - get:
          url: "/hash/123"

# run artillery : > artillery.cmd run --output report.json .\cpu-test.yaml
# make report html : > artillery.cmd report .\report.json