src/test/npm/artillery/cpu-test.yaml
config:
  target: "http://54.180.102.94"
  phases:
    - duration: 60
      arrivalRate: 80
      name: Warm up

scenarios:
  - name: "Just get hash"
    flow:
      - get:
          url: "/hash/123"

# run artillery : > artillery.cmd run --output report.json .\cpu-test.yaml
# make report html : > artillery.cmd report .\report.json